In [1]:
import pandas as pd
import sqlalchemy

In [5]:
engine=sqlalchemy.create_engine('mysql+pymysql://root:root@localhost:3306/pandas')
#for this install PyMySql pip install PyMySql

In [6]:
df=pd.read_sql_table("customers",engine)
df

/home/purva/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1287, "'@@tx_isolation' is deprecated and will be removed in a future release. Please use '@@transaction_isolation' instead")
  result = self._query(query)

   id    name       ph_no
0   1  Donald  1234567890
1   2    Bill  1234567890
2   3    Modi  1234567890

In [7]:
pd.read_sql_table("customers",engine,columns=['name','ph_no'])

     name       ph_no
0  Donald  1234567890
1    Bill  1234567890
2    Modi  1234567890

In [10]:
query1='''
SELECT customers.name,customers.ph_no,orders.name,orders.amount
FROM customers INNER JOIN orders
ON customers.id=orders.customer_id
'''
df=pd.read_sql_query(query1,engine)
df

     name       ph_no          name  amount
0    Bill  1234567890      Yoqa Mat      20
1  Donald  1234567890  Google Pixel     950
2    Modi  1234567890  Fossil Watch     120

In [12]:
extra={
    "name":['abc','def','ghi','jkl','mno'],
    "ph-no":[1234566,434536,363636,5677,24222]
}
df1=pd.DataFrame(extra)
df1

  name    ph-no
0  abc  1234566
1  def   434536
2  ghi   363636
3  jkl     5677
4  mno    24222

In [13]:
#as columns names are not sam in both df ie df n df1
df1=df1.rename(columns={
    'ph-no':'ph_no'
})
df1

  name    ph_no
0  abc  1234566
1  def   434536
2  ghi   363636
3  jkl     5677
4  mno    24222

In [14]:
df1.to_sql(
    name='customers',
    con=engine,
    index=False,
    if_exists='append'   #fail,replace,append
)

In [15]:
pd.read_sql("customers",engine)

    id    name       ph_no
0  1.0  Donald  1234567890
1  2.0    Bill  1234567890
2  3.0    Modi  1234567890
3  NaN     abc     1234566
4  NaN     def      434536
5  NaN     ghi      363636
6  NaN     jkl        5677
7  NaN     mno       24222